{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_11", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "batch_input_shape": [null, null, null, 3], "trainable": true, "kernel_size": [11, 11], "use_bias": true, "dtype": "float32", "bias_constraint": null, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_11", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "rate": 0.25, "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_12", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 48, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_12", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"name": "conv2d_13", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 48, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_13", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"name": "conv2d_14", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 64, "strides": [2, 2], "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_14", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"name": "conv2d_15", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "filters": 2, "strides": [1, 1], "dilation_rate": [1, 1], "padding": "same", "kernel_regularizer": null, "data_format": "channels_last", "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "trainable": true, "kernel_size": [5, 5], "use_bias": true, "bias_constraint": null, "activation": "linear"}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_15", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow", "keras_version": "2.1.1"}