{"config": [{"config": {"activation": "relu", "filters": 32, "padding": "same", "name": "conv2d_101", "kernel_size": [11, 11], "bias_constraint": null, "dilation_rate": [1, 1], "dtype": "float32", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "batch_input_shape": [null, null, null, 3], "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.25, "seed": null, "trainable": true, "name": "dropout_73", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "filters": 48, "padding": "same", "name": "conv2d_102", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "filters": 48, "padding": "same", "name": "conv2d_103", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.25, "seed": null, "trainable": true, "name": "dropout_74", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "filters": 48, "padding": "same", "name": "conv2d_104", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "filters": 48, "padding": "same", "name": "conv2d_105", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.25, "seed": null, "trainable": true, "name": "dropout_75", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "filters": 64, "padding": "same", "name": "conv2d_106", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "relu", "filters": 64, "padding": "same", "name": "conv2d_107", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"rate": 0.25, "seed": null, "trainable": true, "name": "dropout_76", "noise_shape": null}, "class_name": "Dropout"}, {"config": {"activation": "relu", "filters": 2, "padding": "same", "name": "conv2d_108", "kernel_size": [5, 5], "bias_constraint": null, "dilation_rate": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "bias_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "use_bias": true, "kernel_constraint": null, "data_format": "channels_last", "trainable": true, "activity_regularizer": null}, "class_name": "Conv2D"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_19"}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1"}