{"backend": "tensorflow", "class_name": "Sequential", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_size": [7, 7], "trainable": true, "activation": "linear", "name": "conv2d_1", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, null, null, 3], "bias_constraint": null, "dtype": "float32", "use_bias": true, "padding": "same", "filters": 48}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_1", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "seed": null, "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "name": "conv2d_2", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 64}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_2", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "seed": null, "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "name": "conv2d_3", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 128}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_3", "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_3", "seed": null, "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "name": "conv2d_4", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 256}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Dropout", "config": {"name": "dropout_4", "seed": null, "rate": 0.2, "trainable": true, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "dilation_rate": [1, 1], "strides": [1, 1], "activation": "linear", "name": "conv2d_5", "data_format": "channels_last", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "kernel_size": [5, 5], "bias_constraint": null, "use_bias": true, "padding": "same", "filters": 2}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}