{"config": [{"config": {"strides": [1, 1], "name": "conv2d_101", "kernel_constraint": null, "dtype": "float32", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "data_format": "channels_last", "bias_constraint": null, "bias_regularizer": null, "activation": "relu", "filters": 32, "use_bias": true, "batch_input_shape": [null, null, null, 3], "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [11, 11], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_73", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"strides": [2, 2], "name": "conv2d_102", "kernel_constraint": null, "kernel_regularizer": null, "filters": 48, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "name": "conv2d_103", "kernel_constraint": null, "kernel_regularizer": null, "filters": 48, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_74", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"strides": [2, 2], "name": "conv2d_104", "kernel_constraint": null, "kernel_regularizer": null, "filters": 48, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "name": "conv2d_105", "kernel_constraint": null, "kernel_regularizer": null, "filters": 48, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_75", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"strides": [2, 2], "name": "conv2d_106", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"strides": [1, 1], "name": "conv2d_107", "kernel_constraint": null, "kernel_regularizer": null, "filters": 64, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "rate": 0.25, "name": "dropout_76", "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"strides": [1, 1], "name": "conv2d_108", "kernel_constraint": null, "kernel_regularizer": null, "filters": 2, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "activation": "relu", "use_bias": true, "data_format": "channels_last", "bias_constraint": null, "trainable": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "activity_regularizer": null, "padding": "same", "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"trainable": true, "activation": "softmax", "name": "activation_19"}, "class_name": "Activation"}], "backend": "tensorflow", "keras_version": "2.1.1", "class_name": "Sequential"}