{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"name": "conv2d_1", "dilation_rate": [1, 1], "filters": 48, "kernel_regularizer": null, "padding": "same", "bias_regularizer": null, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_size": [7, 7], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "strides": [1, 1], "batch_input_shape": [null, null, null, 3], "trainable": true, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_1", "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_size": [5, 5], "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_2", "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_size": [5, 5], "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "padding": "same", "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_3", "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_size": [5, 5], "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}}, {"class_name": "Dropout", "config": {"noise_shape": null, "rate": 0.2, "name": "dropout_4", "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "dilation_rate": [1, 1], "filters": 2, "kernel_regularizer": null, "padding": "same", "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "kernel_size": [5, 5], "activation": "linear", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "scale": 1.0, "mode": "fan_avg"}}, "bias_constraint": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_5", "trainable": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "backend": "tensorflow"}