{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, null, null, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_267", "dilation_rate": [1, 1], "activation": "relu", "dtype": "float32", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [11, 11], "padding": "same", "filters": 32, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_129", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_268", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_269", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_130", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_270", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_271", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_131", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_272", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_273", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_132", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_274", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 2, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_33", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}