{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, null, null, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_251", "dilation_rate": [1, 1], "activation": "linear", "dtype": "float32", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [11, 11], "padding": "same", "filters": 32, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_121", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_49", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_252", "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_50", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_253", "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_122", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_51", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_254", "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_52", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_255", "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_123", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_53", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_256", "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_54", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_257", "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_124", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_55", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_258", "dilation_rate": [1, 1], "activation": "linear", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 2, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_56", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Activation", "config": {"name": "activation_31", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}