{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, null, null, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_259", "dilation_rate": [1, 1], "activation": "relu", "dtype": "float32", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [11, 11], "padding": "same", "filters": 32, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_125", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_260", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_261", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_126", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_262", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_263", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_127", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_264", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_265", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.1, "name": "dropout_128", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_266", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 2, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_32", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}