{"keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, null, null, 3], "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_243", "dilation_rate": [1, 1], "activation": "relu", "dtype": "float32", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [11, 11], "padding": "same", "filters": 32, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_117", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_244", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_22", "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_245", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_118", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_246", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_23", "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_247", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 48, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_119", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_248", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"pool_size": [2, 2], "strides": [2, 2], "name": "max_pooling2d_24", "padding": "same", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_249", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 64, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Dropout", "config": {"rate": 0.25, "name": "dropout_120", "seed": null, "noise_shape": null, "trainable": true}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}}, "use_bias": true, "kernel_constraint": null, "name": "conv2d_250", "dilation_rate": [1, 1], "activation": "relu", "trainable": true, "data_format": "channels_last", "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "kernel_size": [5, 5], "padding": "same", "filters": 2, "kernel_regularizer": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_30", "activation": "softmax", "trainable": true}}], "backend": "tensorflow"}