{"keras_version": "2.1.1", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [11, 11], "batch_input_shape": [null, null, null, 3], "activation": "linear", "name": "conv2d_7", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 48, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_7", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_4", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_6", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [7, 7], "activation": "linear", "name": "conv2d_8", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 64, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_8", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_5", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_7", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_9", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 128, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_9", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_6", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_8", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_10", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 256, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_10", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.25, "name": "dropout_9", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_11", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 256, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_11", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.25, "name": "dropout_10", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_12", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 2, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_12", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "activation_2", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}