{"keras_version": "2.1.1", "config": [{"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [11, 11], "batch_input_shape": [null, null, null, 3], "activation": "linear", "name": "conv2d_1", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 48, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1], "dtype": "float32"}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_1", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_1", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_1", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [7, 7], "activation": "linear", "name": "conv2d_2", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 64, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_2", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_2", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_2", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_3", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 128, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_3", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"pool_size": [2, 2], "name": "max_pooling2d_3", "data_format": "channels_last", "padding": "same", "trainable": true, "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.25, "name": "dropout_3", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_4", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 256, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_4", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.25, "name": "dropout_4", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_5", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 256, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_5", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"rate": 0.25, "name": "dropout_5", "trainable": true, "noise_shape": null, "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [5, 5], "activation": "linear", "name": "conv2d_6", "use_bias": true, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "bias_constraint": null, "activity_regularizer": null, "strides": [1, 1], "data_format": "channels_last", "kernel_regularizer": null, "padding": "same", "filters": 2, "trainable": true, "kernel_constraint": null, "dilation_rate": [1, 1]}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_6", "alpha": 0.10000000149011612, "trainable": true}, "class_name": "LeakyReLU"}, {"config": {"name": "activation_1", "activation": "softmax", "trainable": true}, "class_name": "Activation"}], "backend": "tensorflow", "class_name": "Sequential"}