{"backend": "tensorflow", "keras_version": "2.1.1", "class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_size": [7, 7], "kernel_constraint": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 48, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_16", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "batch_input_shape": [null, null, null, 3], "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_16", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_10", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_13", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 64, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_17", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_17", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_11", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_14", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 128, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_18", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_18", "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_12", "padding": "same", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_15", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 256, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_19", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_19", "alpha": 0.10000000149011612}}, {"class_name": "Dropout", "config": {"rate": 0.2, "trainable": true, "name": "dropout_16", "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_regularizer": null, "bias_constraint": null, "kernel_size": [5, 5], "kernel_constraint": null, "activation": "linear", "use_bias": true, "dilation_rate": [1, 1], "trainable": true, "filters": 2, "strides": [1, 1], "data_format": "channels_last", "name": "conv2d_20", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "padding": "same", "activity_regularizer": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "name": "leaky_re_lu_20", "alpha": 0.10000000149011612}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_4"}}]}