{"class_name": "Sequential", "keras_version": "2.1.1", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"kernel_size": [10, 10], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "filters": 48, "bias_regularizer": null, "use_bias": true, "name": "conv2d_31", "batch_input_shape": [null, null, null, 3], "dtype": "float32", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_31"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_22", "data_format": "channels_last", "padding": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_25", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [7, 7], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_32", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_32"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_23", "data_format": "channels_last", "padding": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_26", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_33", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_33"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_24", "data_format": "channels_last", "padding": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_27", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "filters": 256, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_34", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_34"}}, {"class_name": "MaxPooling2D", "config": {"strides": [2, 2], "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_25", "data_format": "channels_last", "padding": "same"}}, {"class_name": "Dropout", "config": {"name": "dropout_28", "trainable": true, "rate": 0.25, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_size": [5, 5], "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}}, "strides": [1, 1], "activation": "linear", "bias_regularizer": null, "use_bias": true, "name": "conv2d_35", "dilation_rate": [1, 1], "kernel_constraint": null, "bias_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same"}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_35"}}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_7"}}]}