{"config": [{"class_name": "Conv2D", "config": {"batch_input_shape": [null, null, null, 3], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_16", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 48, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": false, "activation": "linear", "kernel_size": [7, 7], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": false, "alpha": 0.10000000149011612, "name": "leaky_re_lu_16"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": false, "pool_size": [2, 2], "name": "max_pooling2d_10"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": false, "rate": 0.2, "name": "dropout_13", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_17", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": false, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": false, "alpha": 0.10000000149011612, "name": "leaky_re_lu_17"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": false, "pool_size": [2, 2], "name": "max_pooling2d_11"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": false, "rate": 0.2, "name": "dropout_14", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_18", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 128, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": false, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": false, "alpha": 0.10000000149011612, "name": "leaky_re_lu_18"}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "same", "strides": [2, 2], "trainable": false, "pool_size": [2, 2], "name": "max_pooling2d_12"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": false, "rate": 0.2, "name": "dropout_15", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_19", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 256, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": false, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": false, "alpha": 0.10000000149011612, "name": "leaky_re_lu_19"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": false, "rate": 0.2, "name": "dropout_16", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_20", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 2, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": false, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": false, "alpha": 0.10000000149011612, "name": "leaky_re_lu_20"}}, {"class_name": "Activation", "config": {"trainable": false, "activation": "softmax", "name": "activation_4"}}, {"class_name": "Conv2D", "config": {"batch_input_shape": [null, null, null, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "dtype": "float32", "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_25", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 48, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_size": [7, 7], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_25"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_20", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_26", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_26"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_21", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_27", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 64, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_27"}}, {"class_name": "Dropout", "config": {"noise_shape": null, "trainable": true, "rate": 0.25, "name": "dropout_22", "seed": null}}, {"class_name": "Conv2D", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "dilation_rate": [1, 1], "kernel_regularizer": null, "padding": "same", "kernel_constraint": null, "name": "conv2d_28", "bias_constraint": null, "data_format": "channels_last", "use_bias": true, "filters": 2, "activity_regularizer": null, "strides": [1, 1], "bias_regularizer": null, "trainable": true, "activation": "linear", "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "LeakyReLU", "config": {"trainable": true, "alpha": 0.10000000149011612, "name": "leaky_re_lu_28"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "softmax", "name": "activation_6"}}], "class_name": "Sequential", "keras_version": "2.1.1", "backend": "tensorflow"}