{"config": [{"config": {"kernel_size": [11, 11], "bias_regularizer": null, "name": "conv2d_1", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "activation": "linear", "data_format": "channels_last", "dtype": "float32", "batch_input_shape": [null, null, null, 3], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 48, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_1", "padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_1", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [7, 7], "bias_regularizer": null, "name": "conv2d_2", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_2", "padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_2", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [5, 5], "bias_regularizer": null, "name": "conv2d_3", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"data_format": "channels_last", "name": "max_pooling2d_3", "padding": "same", "strides": [2, 2], "trainable": true, "pool_size": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_3", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [5, 5], "bias_regularizer": null, "name": "conv2d_4", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 128, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_4", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [5, 5], "bias_regularizer": null, "name": "conv2d_5", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_5", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [5, 5], "bias_regularizer": null, "name": "conv2d_6", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 64, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_6", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"noise_shape": null, "rate": 0.25, "trainable": true, "name": "dropout_6", "seed": null}, "class_name": "Dropout"}, {"config": {"kernel_size": [5, 5], "bias_regularizer": null, "name": "conv2d_7", "padding": "same", "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "seed": null, "scale": 1.0}, "class_name": "VarianceScaling"}, "dilation_rate": [1, 1], "trainable": true, "activation": "linear", "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_constraint": null, "filters": 2, "kernel_regularizer": null, "bias_constraint": null, "strides": [1, 1], "use_bias": true}, "class_name": "Conv2D"}, {"config": {"name": "leaky_re_lu_7", "trainable": true, "alpha": 0.10000000149011612}, "class_name": "LeakyReLU"}, {"config": {"name": "activation_1", "trainable": true, "activation": "softmax"}, "class_name": "Activation"}], "class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1"}