{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [11, 11], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "filters": 32, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_68", "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, null, null, 3], "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_41", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_69", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_19", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_70", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_42", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_71", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_20", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_72", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_43", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_73", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_21", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_74", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_44", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_75", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "softmax"}}]}