{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [11, 11], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "filters": 32, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_59", "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, null, null, 3], "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_37", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_60", "strides": [2, 2], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_61", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_38", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_62", "strides": [2, 2], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 48, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_63", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_39", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_64", "strides": [2, 2], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_65", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_40", "trainable": true, "rate": 0.25, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_66", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_67", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "softmax"}}]}