{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [7, 7], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "filters": 64, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_31", "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, null, null, 3], "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_32", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_7", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_33", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_8", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_19", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_34", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_9", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_20", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_35", "strides": [1, 1], "activation": "linear", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "softmax"}}]}