{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.1", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [7, 7], "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "filters": 64, "kernel_regularizer": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_122", "strides": [1, 1], "activity_regularizer": null, "bias_constraint": null, "batch_input_shape": [null, null, null, 3], "use_bias": true, "bias_regularizer": null, "dilation_rate": [1, 1], "padding": "same", "kernel_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_40", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_77", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_123", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_41", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_78", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_124", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_42", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "padding": "same", "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_79", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_125", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Dropout", "config": {"name": "dropout_80", "trainable": true, "rate": 0.2, "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "kernel_size": [5, 5], "filters": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "bias_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "name": "conv2d_126", "strides": [1, 1], "activation": "relu", "activity_regularizer": null, "kernel_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "padding": "same", "bias_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": true, "activation": "softmax"}}]}