{"backend": "tensorflow", "config": [{"config": {"filters": 32, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_14", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, null, null, 3], "kernel_constraint": null, "dtype": "float32", "padding": "same", "kernel_size": [11, 11], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_6", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"filters": 48, "strides": [2, 2], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_15", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"filters": 48, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_16", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_7", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"filters": 48, "strides": [2, 2], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_17", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"filters": 48, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_18", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_8", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"filters": 64, "strides": [2, 2], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_19", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"filters": 64, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_20", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"name": "dropout_9", "trainable": true, "seed": null, "rate": 0.25, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"filters": 2, "strides": [1, 1], "bias_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "name": "conv2d_21", "data_format": "channels_last", "activation": "relu", "use_bias": true, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "bias_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "padding": "same", "kernel_size": [5, 5], "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D"}, {"config": {"trainable": true, "name": "activation_3", "activation": "softmax"}, "class_name": "Activation"}], "keras_version": "2.1.1", "class_name": "Sequential"}