{"keras_version": "2.1.1", "backend": "tensorflow", "config": [{"class_name": "Conv2D", "config": {"padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "batch_input_shape": [null, null, null, 3], "filters": 32, "bias_regularizer": null, "trainable": true, "kernel_size": [11, 11], "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "use_bias": true, "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_16", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_16", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Dropout", "config": {"rate": 0.25, "noise_shape": null, "name": "dropout_4", "trainable": true, "seed": null}}, {"class_name": "Conv2D", "config": {"padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 48, "bias_regularizer": null, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_17", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_17", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 48, "bias_regularizer": null, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_18", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_18", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 64, "bias_regularizer": null, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [2, 2], "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_19", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_19", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Conv2D", "config": {"padding": "same", "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "use_bias": true, "filters": 2, "bias_regularizer": null, "trainable": true, "kernel_size": [5, 5], "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1, 1], "data_format": "channels_last", "activity_regularizer": null, "dilation_rate": [1, 1], "bias_constraint": null, "name": "conv2d_20", "kernel_regularizer": null, "kernel_constraint": null}}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_20", "trainable": true, "alpha": 0.10000000149011612}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_4", "trainable": true}}], "class_name": "Sequential"}